# Intersect Method (Face) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Face..::..Intersect Method (Face)
Face Class See Also
---
Calculates the intersection of the specified face with this face and returns the intersection results.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FaceIntersectionFaceResult Intersect(
	Face face
)
```

Visual Basic
---
```text
Public Function Intersect ( _
	face As Face _
) As FaceIntersectionFaceResult
```

Visual C++
---
```text
public:
FaceIntersectionFaceResult Intersect(
	Face^ face
)
```

# ### Parameters
face
    Type: Autodesk.Revit.DB..::..FaceThe specified face to intersect with this face.
# ### Return Value
  * FaceIntersectionFaceResult.Intersecting - One or more intersections were encountered.
  * SetComparisonResult.NonIntersecting - There is no intersection found.

# Remarks
This is not a general-purpose function: it only works properly for simple configurations. For other configurations, it may return an incorrect result. Some configurations for which the function might return a correct result are:
  * A planar face that fully intersects another face in a single curve, when the other face is planar or cylindrical.
  * A cylindrical face that fully intersects another face in a single curve, when the other face is planar.

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | The face is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The intersection calculation fails. |

# See Also
Face Class
Intersect Overload
Autodesk.Revit.DB Namespace